---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsServiceTypeParam
source: html/dd2d8212-6907-eabc-c259-3b8246b28b2d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsServiceTypeParam Property

"Building Service"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsServiceTypeParam { get; }
```